In [2]:
import numpy as np
import pandas as pd
import duckdb

def sqldf(query) :
    return duckdb.sql(query).df()

In [3]:
#1. Create the dataframe
data = {
 'EmployeeID': [101, 102, 103, 104, 105, 106, 107],
 'LastName': ['Smith', 'Johnson', 'Williams', 'Brown', 'Jones', 'Garcia', 'Miller'],
 'Department': ['Sales', 'IT', 'Marketing', 'Sales', 'HR', None, 'IT'],
 'Salary': [65000.00, 95000.00, 55000.00, 72000.00, 80000.00, 48000.00, 110000.00],
 'HireDate': ['2023-01-15', '2024-06-01', '2023-08-20', '2023-10-10', '2024-03-05', '2022-11-22', '2025-01-01']
}

Employees = pd.DataFrame(data)

Employees

   EmployeeID  LastName Department    Salary    HireDate
0         101     Smith      Sales   65000.0  2023-01-15
1         102   Johnson         IT   95000.0  2024-06-01
2         103  Williams  Marketing   55000.0  2023-08-20
3         104     Brown      Sales   72000.0  2023-10-10
4         105     Jones         HR   80000.0  2024-03-05
5         106    Garcia       None   48000.0  2022-11-22
6         107    Miller         IT  110000.0  2025-01-01

In [4]:
#Define a simple SQL query

sql_query = """SELECT * FROM Employees;"""

In [5]:
result_df = sqldf(sql_query)

print(result_df)

   EmployeeID  LastName Department    Salary    HireDate
0         101     Smith      Sales   65000.0  2023-01-15
1         102   Johnson         IT   95000.0  2024-06-01
2         103  Williams  Marketing   55000.0  2023-08-20
3         104     Brown      Sales   72000.0  2023-10-10
4         105     Jones         HR   80000.0  2024-03-05
5         106    Garcia       None   48000.0  2022-11-22
6         107    Miller         IT  110000.0  2025-01-01

In [6]:
sql_query = """SELECT EmployeeID,Salary
FROM Employees;"""

In [7]:
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID    Salary
0         101   65000.0
1         102   95000.0
2         103   55000.0
3         104   72000.0
4         105   80000.0
5         106   48000.0
6         107  110000.0

In [8]:
sql_query = """SELECT * FROM Employees WHERE Department = 'Sales';"""

In [9]:
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID LastName Department   Salary    HireDate
0         101    Smith      Sales  65000.0  2023-01-15
1         104    Brown      Sales  72000.0  2023-10-10

In [10]:
#Find all the employees in the IT dept with a salary greater than 100,000

sql_query = """SELECT * FROM Employees WHERE Department = 'IT' AND Salary > 100000.00;"""

In [11]:
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID LastName Department    Salary    HireDate
0         107   Miller         IT  110000.0  2025-01-01

In [12]:
#filter all the employees in HR department OR joined after '2024-01-01'
sql_query = """SELECT * FROM Employees WHERE Department = 'HR' OR HireDate = '2024-01-01';"""

In [13]:
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID LastName Department   Salary    HireDate
0         105    Jones         HR  80000.0  2024-03-05

In [14]:
# Filter employees where dept is not engineering
sql_query = """SELECT * FROM Employees WHERE NOT Department = 'IT';"""

In [15]:
result_df = sqldf(sql_query)
print(sql_query)

SELECT * FROM Employees WHERE NOT Department = 'IT';

# Filtering with special operators

In [16]:
#find employees whose salary is between 50000 and 75000

sql_query = """SELECT * FROM Employees WHERE Salary BETWEEN 50000 AND 75000;"""
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID  LastName Department   Salary    HireDate
0         101     Smith      Sales  65000.0  2023-01-15
1         103  Williams  Marketing  55000.0  2023-08-20
2         104     Brown      Sales  72000.0  2023-10-10

In [17]:

sql_query = """SELECT * FROM Employees WHERE Department IN ('IT','Sales','HR');"""
result_df = sqldf(sql_query)
print(result_df)

   EmployeeID LastName Department    Salary    HireDate
0         101    Smith      Sales   65000.0  2023-01-15
1         102  Johnson         IT   95000.0  2024-06-01
2         104    Brown      Sales   72000.0  2023-10-10
3         105    Jones         HR   80000.0  2024-03-05
4         107   Miller         IT  110000.0  2025-01-01

# Pattern matching (LIKE)

In [18]:
sql_query = """SELECT LastName, Department, Salary FROM Employees
WHERE LastName LIKE 'J%' OR Department = 'Marketing';"""

result_df = sqldf(sql_query)
print(result_df)

   LastName Department   Salary
0   Johnson         IT  95000.0
1  Williams  Marketing  55000.0
2     Jones         HR  80000.0

# Cleaning Data

In [19]:
import pandas as pd

data = {
'CustomerID': [1, 2, 3, 4, 5],
'Name': [' alice  ', 'BOB SMITH', 'Charlie.D', 'dave ', 'eve '],
'ProductCode': ['A-101-L', 'b-202-XL', 'C-303-S',  'A-101-M ', 'D-404-M'],
'Email': [' aLice@mail.com', 'BOB@work.net ', 'charLIE@web.io ', 
'dave@corp.co ', 'eve@home.net']
}

customer_data = pd.DataFrame(data)

customer_data

   CustomerID       Name ProductCode            Email
0           1    alice       A-101-L   aLice@mail.com
1           2  BOB SMITH    b-202-XL    BOB@work.net
2           3  Charlie.D     C-303-S  charLIE@web.io
3           4      dave     A-101-M     dave@corp.co
4           5       eve      D-404-M     eve@home.net

In [20]:
#TRIM
sql_munging_1 = """SELECT CustomerID, UPPER(TRIM(Name)) AS Standardized_Name,
LOWER(Email) AS Cleaned_Email FROM customer_data;"""

df_standardized = sqldf(sql_munging_1)
print(df_standardized)

   CustomerID Standardized_Name    Cleaned_Email
0           1             ALICE   alice@mail.com
1           2         BOB SMITH    bob@work.net
2           3         CHARLIE.D  charlie@web.io
3           4              DAVE    dave@corp.co
4           5               EVE     eve@home.net

In [21]:
#LTRIM AND RTRIM
sql_munging_2 = """SELECT CustomerID,RTRIM(Name) AS Right_trimmed_Name,
LTRIM(Email) AS Left_Trimmed_Email FROM customer_data;"""

df_standardized = sqldf(sql_munging_2)
print(df_standardized)

   CustomerID Right_trimmed_Name Left_Trimmed_Email
0           1              alice     aLice@mail.com
1           2          BOB SMITH      BOB@work.net
2           3          Charlie.D    charLIE@web.io
3           4               dave      dave@corp.co
4           5                eve       eve@home.net

In [22]:
#REPLACE - Replaces all occurences of a substring with someother string
#REPLACE 'L' with 'XL'

sql_munging_3 = """SELECT CustomerID,ProductCode,REPLACE(REPLACE(ProductCode,'L','XL'),'-','') AS Cleaned_ProductCode
FROM customer_data;"""

df_standardized = sqldf(sql_munging_3)
print(df_standardized)

   CustomerID ProductCode Cleaned_ProductCode
0           1     A-101-L              A101XL
1           2    b-202-XL             b202XXL
2           3     C-303-S               C303S
3           4    A-101-M               A101M
4           5     D-404-M               D404M

In [23]:
sql_munging_4 = """SELECT CustomerID, ProductCode, LEFT(ProductCode,3) AS Item_Type_Prefix,
RIGHT(Email,4) AS Domain_Suffix FROM customer_data;"""

df_standardized = sqldf(sql_munging_4)
print(df_standardized)

   CustomerID ProductCode Item_Type_Prefix Domain_Suffix
0           1     A-101-L              A-1          .com
1           2    b-202-XL              b-2          net
2           3     C-303-S              C-3          .io
3           4    A-101-M               A-1          .co
4           5     D-404-M              D-4          .net

In [24]:
sql_munging_4_corrected = """SELECT CustomerID, ProductCode, SUBSTR(ProductCode,1,3) AS Item_Type_Prefix,
SUBSTR(Email,-4) AS Domain_Suffix FROM customer_data;"""

df_standardized = sqldf(sql_munging_4_corrected)
print(df_standardized)

   CustomerID ProductCode Item_Type_Prefix Domain_Suffix
0           1     A-101-L              A-1          .com
1           2    b-202-XL              b-2          net
2           3     C-303-S              C-3          .io
3           4    A-101-M               A-1          .co
4           5     D-404-M              D-4          .net

In [25]:
data = {'city': ['NY', 'LA', 'NY', 'LA', 'Chicago'],
'sales': [100, 150, 120, 90, 80]}

df = pd.DataFrame(data)

df

      city  sales
0       NY    100
1       LA    150
2       NY    120
3       LA     90
4  Chicago     80

In [26]:
#City wise sum up the sale and arrange in descending order
sql_query = """SELECT City,SUM(sales) AS Total_sales FROM df 
GROUP BY city
ORDER BY total_sales DESC"""

result_df = sqldf(sql_query)

print(result_df)

      city  Total_sales
0       LA        240.0
1       NY        220.0
2  Chicago         80.0

In [27]:
students_df = pd.DataFrame({
'student_id': [1, 2, 3, 4, 5],
'name': ['Zoe', 'Liam', 'Noah', 'Emma', 'Ava'],
'score': [92, 45, 78, 88, 55]
})

In [28]:
sql_case_logic = """SELECT name,score,
CASE
   WHEN score >= 90 THEN 'A'
   WHEN score >= 80 THEN 'B'
   WHEN score >= 70 THEN 'C'
   WHEN score >= 60 THEN 'D'
   ELSE 'F'
END AS letter_grade,
CASE 
   WHEN score >= 60 THEN 'Pass'
   ELSE 'Fail'
END AS status
FROM students_df; """

result_df = sqldf(sql_case_logic)
print(result_df)

   name  score letter_grade status
0   Zoe     92            A   Pass
1  Liam     45            F   Fail
2  Noah     78            C   Pass
3  Emma     88            B   Pass
4   Ava     55            F   Fail

In [29]:
data = {
 'product': ['Laptop', 'Mouse', 'Monitor', 'Keyboard'],
 'sale_price': [1200, None, 300, None],
 'suggested_price':[1150, 25, None, 70],
 'default_price': [1000, 20, 250, 50]
}

df = pd.DataFrame(data)
df

    product  sale_price  suggested_price  default_price
0    Laptop      1200.0           1150.0           1000
1     Mouse         NaN             25.0             20
2   Monitor       300.0              NaN            250
3  Keyboard         NaN             70.0             50

# COALESCE

In [30]:
sql_query = """SELECT
            product,sale_price,suggested_price,
            COALESCE(sale_price,suggested_price) AS final_price
            FROM df;"""

result_df = sqldf(sql_query)
print(result_df)

    product  sale_price  suggested_price  final_price
0    Laptop      1200.0           1150.0       1200.0
1     Mouse         NaN             25.0         25.0
2   Monitor       300.0              NaN        300.0
3  Keyboard         NaN             70.0         70.0

In [31]:
sql_query = """SELECT
            product,sale_price,suggested_price,
            COALESCE(sale_price,1000) AS sale_price
            FROM df;"""

result_df = sqldf(sql_query)
print(result_df)

    product  sale_price  suggested_price  sale_price_1
0    Laptop      1200.0           1150.0        1200.0
1     Mouse         NaN             25.0        1000.0
2   Monitor       300.0              NaN         300.0
3  Keyboard         NaN             70.0        1000.0

# NULLIF

In [32]:
df = pd.DataFrame({
 'product': ['Laptop', 'Mouse', 'Monitor', 'Keyboard'],
 'revenue': [5000, 200, 1500, 0],
 'units_sold': [10, 5, 0, 0],# 0 will cause division error
 'category': ['Electronics', '', 'Electronics', 'Unknown']
})
df

    product  revenue  units_sold     category
0    Laptop     5000          10  Electronics
1     Mouse      200           5
2   Monitor     1500           0  Electronics
3  Keyboard        0           0      Unknown

In [33]:
sql_query = """SELECT product,
                revenue / NULLIF(units_sold,0) AS price_per_unit,
                NULLIF(category,'') AS cleaned_category FROM df;"""

result_df = sqldf(sql_query)
print(result_df)

    product  price_per_unit cleaned_category
0    Laptop           500.0      Electronics
1     Mouse            40.0             None
2   Monitor             NaN      Electronics
3  Keyboard             NaN          Unknown

# JOINS

## Inner join

In [34]:
import pandas as pd
import duckdb

# The left table
employees = pd.DataFrame({
 'emp_id': [1, 2, 3, 4],
 'name': ['Alice', 'Bob', 'Charlie', 'David'],
 'dept_id': [10, 20, 10, 40]
})

# The Right Table
departments = pd.DataFrame({
 'dept_id': [10, 20, 30],
 'dept_name': ['HR', 'IT', 'Marketing'] # Note: Marketing has no employees
})

In [35]:
print("### employees Table ### \n\n",employees,"\n")
print("### Department Table ### \n\n",departments,"\n")

### employees Table ###

    emp_id     name  dept_id
0       1    Alice       10
1       2      Bob       20
2       3  Charlie       10
3       4    David       40

### Department Table ###

    dept_id  dept_name
0       10         HR
1       20         IT
2       30  Marketing

In [36]:
inner_query = """SELECT * FROM employees e INNER JOIN departments d 
ON e.dept_id = d.dept_id"""

print(duckdb.query(inner_query).to_df())

   emp_id     name  dept_id  dept_id_1 dept_name
0       1    Alice       10         10        HR
1       2      Bob       20         20        IT
2       3  Charlie       10         10        HR

In [37]:
inner_query = """SELECT e.name,d.dept_name FROM employees e INNER JOIN departments d 
ON e.dept_id = d.dept_id"""

print(duckdb.query(inner_query).to_df())

      name dept_name
0    Alice        HR
1      Bob        IT
2  Charlie        HR

# Left join

In [38]:
left_query = """SELECT * FROM employees e LEFT JOIN departments D ON e.dept_id = d.dept_id"""
print(duckdb.query(left_query).to_df())

   emp_id     name  dept_id  dept_id_1 dept_name
0       1    Alice       10         10        HR
1       2      Bob       20         20        IT
2       3  Charlie       10         10        HR
3       4    David       40       <NA>      None

# right join

In [39]:
right_query = """SELECT e.name,d.dept_name FROM employees e RIGHT JOIN departments d ON e.dept_id = d.dept_id"""
print(duckdb.query(right_query).to_df())

      name  dept_name
0    Alice         HR
1      Bob         IT
2  Charlie         HR
3     None  Marketing

# outer join (full outer join)

In [40]:
full_query = """SELECT * FROM employees e FULL OUTER JOIN departments d ON e.dept_id = d.dept_id"""
print(duckdb.query(full_query).to_df())

   emp_id     name  dept_id  dept_id_1  dept_name
0       1    Alice       10         10         HR
1       2      Bob       20         20         IT
2       3  Charlie       10         10         HR
3       4    David       40       <NA>       None
4    <NA>     None     <NA>         30  Marketing

# AGGREGATION

In [41]:
df = pd.DataFrame({
 'transaction_id': [1, 2, 3, 4, 5, 6],
 'category': ['Electronics', 'Furniture', 'Electronics', 'Electronics', 'Furniture', 'Toys'],
 'sales_amount': [1200, 450, 800, 150, 300, 50],
 'quantity': [1, 2, 1, 3, 1, 5],
 'discount': [0.1, None, 0.05, None, 0.2, 0.0]
})
print(df)

   transaction_id     category  sales_amount  quantity  discount
0               1  Electronics          1200         1      0.10
1               2    Furniture           450         2       NaN
2               3  Electronics           800         1      0.05
3               4  Electronics           150         3       NaN
4               5    Furniture           300         1      0.20
5               6         Toys            50         5      0.00

In [42]:
query_basic = """SELECT DISTINCT category FROM df"""
print(duckdb.query(query_basic).to_df())

      category
0         Toys
1    Furniture
2  Electronics

In [43]:
query_basic = """SELECT GREATEST (15000,sales_amount) as greatest,
LEAST(1000,sales_amount) as least FROM df"""
print(duckdb.query(query_basic).to_df())
print(df)

   greatest  least
0     15000   1000
1     15000    450
2     15000    800
3     15000    150
4     15000    300
5     15000     50
   transaction_id     category  sales_amount  quantity  discount
0               1  Electronics          1200         1      0.10
1               2    Furniture           450         2       NaN
2               3  Electronics           800         1      0.05
3               4  Electronics           150         3       NaN
4               5    Furniture           300         1      0.20
5               6         Toys            50         5      0.00

In [44]:
query_basic = """SELECT 
SUM(sales_amount) AS total_revenue,
AVG(sales_amount) AS average_sale,
MIN(sales_amount) AS cheapest_sale,
MAX(sales_amount) AS epensive_sale,
COUNT(transaction_id) AS total_transactions,
COUNT(discount) AS transactions_with_discounts FROM df"""
print(duckdb.query(query_basic).to_df())

   total_revenue  average_sale  cheapest_sale  epensive_sale  \
0         2950.0    491.666667             50           1200

   total_transactions  transactions_with_discounts
0                   6                            4

# GROUP BY

In [45]:
query_grouped = """SELECT category,SUM(sales_Amount) AS category_revenue,
COUNT(*) AS item_count FROM df GROUP BY category;"""
print(duckdb.query(query_grouped).to_df())

      category  category_revenue  item_count
0  Electronics            2150.0           3
1         Toys              50.0           1
2    Furniture             750.0           2

# ORDER BY

In [46]:
query_grouped = """SELECT category,SUM(sales_Amount) AS category_revenue,
COUNT(*) AS item_count FROM df GROUP BY category ORDER BY category_revenue DESC;"""
print(duckdb.query(query_grouped).to_df())

      category  category_revenue  item_count
0  Electronics            2150.0           3
1    Furniture             750.0           2
2         Toys              50.0           1

In [47]:
data = {
 'EmployeeName': ['David', 'Edward', 'Alice', 'Bob', 'Charlie', 'Fiona'],
 'Salary': [6000, 6000, 5000, 4500, 4500, 3000]
}

Employees = pd.DataFrame(data)

In [48]:
query = """
SELECT EmployeeName,
       Salary,
       ROW_NUMBER() OVER (ORDER BY Salary DESC) as RowNum,
       RANK() OVER (ORDER BY Salary DESC) as RowVal,
       DENSE_RANK() OVER (ORDER BY Salary DESC) as DenseRank,
       ROUND(PERCENT_RANK() OVER (ORDER BY Salary DESC), 2) as Rounded_rank
FROM Employees
"""

result = duckdb.sql(query).df()
print(result)

  EmployeeName  Salary  RowNum  RowVal  DenseRank  Rounded_rank
0        David    6000       1       1          1           0.0
1       Edward    6000       2       1          1           0.0
2        Alice    5000       3       3          2           0.4
3          Bob    4500       4       4          3           0.6
4      Charlie    4500       5       4          3           0.6
5        Fiona    3000       6       6          4           1.0

# Entile and cumulative distribution

In [55]:
# Dataset: Student Exam Results
data = {
    'Student': ['Sam', 'Jia', 'Leo', 'Mia', 
                'Ted', 'Zoe', 'Ben', 'Eva', 'Abe', 'Dan'],
    'Marks': [95, 88, 88, 76, 72, 65, 60, 55, 40, 30]
}

Grades = pd.DataFrame(data)
print(Grades)

  Student  Marks
0     Sam     95
1     Jia     88
2     Leo     88
3     Mia     76
4     Ted     72
5     Zoe     65
6     Ben     60
7     Eva     55
8     Abe     40
9     Dan     30

In [56]:
# SQL Query for NTILE and CUME_DIST
query = """
SELECT
    Student,
    Marks,

    -- NTILE(4): Groups students into 4 buckets (Top 25%, Next 25%, etc.)
    NTILE(4) OVER (ORDER BY Marks DESC) AS Quartile,

    -- CUME_DIST: Cumulative distribution (relative position of a value)
    ROUND(CUME_DIST() OVER (ORDER BY Marks DESC), 2) AS Cumulative_Dist

FROM Grades;
"""

# Execute on the DataFrame
result = duckdb.sql(query).df()

print("---- Student Distribution Analysis ----")
print(result)

---- Student Distribution Analysis ----
  Student  Marks  Quartile  Cumulative_Dist
0     Sam     95         1              0.1
1     Jia     88         1              0.3
2     Leo     88         1              0.3
3     Mia     76         2              0.4
4     Ted     72         2              0.5
5     Zoe     65         2              0.6
6     Ben     60         3              0.7
7     Eva     55         3              0.8
8     Abe     40         4              0.9
9     Dan     30         4              1.0

In [51]:
data = {
 'Player': ['Apex', 'Brave', 'Cinder', 'Drift', 'Echo', 'Frost'],
 'Level': [10, 12, 8, 15, 10, 14],
 'Score': [2500, 3200, 1800, 4500, 2900, 4100]
}

Tournament = pd.DataFrame(data)
print(Tournament)

   Player  Level  Score
0    Apex     10   2500
1   Brave     12   3200
2  Cinder      8   1800
3   Drift     15   4500
4    Echo     10   2900
5   Frost     14   4100

In [52]:
query = """SELECT 
    Player,
    Score,

    -- LAG: The score of the player immediately below this one in rank
    LAG(Score) OVER (ORDER BY Score DESC) AS Score_Above,

    -- LEAD: The score of the player immediately above this one in rank
    LEAD(Score) OVER (ORDER BY Score DESC) AS Score_Below,

    -- FIRST_VALUE: The player who is the absolute tournament leader
    FIRST_VALUE(Player) OVER (ORDER BY Score DESC) AS Tournament_Leader,

    -- LAST_VALUE: The player with the lowest score (using full window)
    LAST_VALUE(Player) OVER (
        ORDER BY Score DESC
        ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
    ) AS Last_Place_Player

FROM Tournament;"""

result = duckdb.sql(query).df()
print(result)

   Player  Score  Score_Above  Score_Below Tournament_Leader Last_Place_Player
0   Drift   4500         <NA>         4100             Drift            Cinder
1   Frost   4100         4500         3200             Drift            Cinder
2   Brave   3200         4100         2900             Drift            Cinder
3    Echo   2900         3200         2500             Drift            Cinder
4    Apex   2500         2900         1800             Drift            Cinder
5  Cinder   1800         2500         <NA>             Drift            Cinder

# Basic statistics

In [53]:
# Import libraries
import pandas as pd
import duckdb

# Dataset: House prices in thousands
data = {
    'House_ID': [1, 2, 3, 4, 5, 6, 7],
    'Price': [250, 300, 300, 450, 500, 550, 2000]  # 2000 is an outlier
}

Properties = pd.DataFrame(data)
Properties

   House_ID  Price
0         1    250
1         2    300
2         3    300
3         4    450
4         5    500
5         6    550
6         7   2000

In [54]:
# SQL Query for Mean, Median, and Mode
query = """
SELECT
    -- 1. Mean (Arithmetic Average)
    ROUND(AVG(Price), 2) AS Mean_Price,

    -- 2. Median (The middle value when sorted)
    MEDIAN(Price) AS Median_Price,

    -- 3. Mode (The most frequent value)
    MODE(Price) AS Mode_Price

FROM Properties;
"""

# Execute directly on the DataFrame
result = duckdb.sql(query).df()

print("---- Central Tendency Analysis ----")
print(result)

---- Central Tendency Analysis ----
   Mean_Price  Median_Price  Mode_Price
0      621.43         450.0         300